;prompt  equ 0F86Ch
prompt  equ 0F89Dh
puts    equ 0F818h

scrn	equ 76d0h	;адрес левого верхнего угла экр

	org 0
;	lxi h, msg
;	call puts
;930h 
;76D0-7FFF
;1000h
	;call P_VG75
	;call monitor_config
	call from_ball
looper:
	lxi b, 8E8h ;размер
	lxi d, msg
	lxi h, 76d0h
	call memcpy
	jmp looper
	;jmp prompt


	; bc: number of bytes to copy
	; de: source block
	; hl: target block
memcpy:
	mov     a,b         ;Copy register B to register A
	ora     c           ;Bitwise OR of A and C into register A
	rz                  ;Return if the zero-flag is set high.
loop:
	ldax    d          ;Load A from the address pointed by DE
	mov     m,a         ;Store A into the address pointed by HL
	inx     d          ;Increment DE
	inx     h          ;Increment HL
	dcx     b          ;Decrement BC   (does not affect Flags)
	mov     a,b         ;Copy B to A    (so as to compare BC with zero)
	ora     c           ;A = A | C      (set zero)
	jnz     loop        ;Jump to 'loop:' if the zero-flag is not set.
	ret                 ;Return

monitor_config:
	lxi h, 0d001h	; регистр признаков
	mvi m, 00h		; сброс
	dcx h			; регистр команд
	mvi m, 4dh		; 0.1001101  77 (77+1 знакомест)
	mvi m, 1dh		; 00.011101  29 (29+1 строк)
	; 1001.1001  9 9 (9+1 линия подчерк)
	; (9+1 линий в знакоместе)
	mvi m, 99h;mvi m, 77h;;пробуем изменить линии в знакоместе
	;mvi m, 77h; 7 линий без подчёркивания, 7 линий в знакоместе
	
	mvi m, 93h; мерцающее подчёркивание
	;mvi m, 0b3h; немерцающее подчёркивание**
	;mvi m, 0a3; немерцающий негативный видеоблок
	;mvi m, 73h	; немерцающее подчёркивание, атрибут поля прозрачный **
;ПДП
	mvi a, 80h
	sta 0f808h; запись управляющего слова в регистр управления
	lxi h, 0f804h
	mvi m, lo(scrn);0d0h;мл. адрес откуда
	mvi m, hi(scrn);76h ст. адрес откуда
	inx h; 0f805h
	mvi m, 23h
	mvi m, 49h ; размер массива 0923h и единица в разряде D14 - направление передачи
;ПДП end
	lxi h, 0d001h
	mvi m, 27h
	mvi m, 0e0h
;ПДП
	mvi a, 0a4h ;автозагрузка, удлинённая запись, канал 2
	sta 0f808h
;ПДП end
	ret

video_config:;вариация с 38 строками, не работает нормально на мониторах
	lxi h, 0d001h	; регистр признаков
	mvi m, 00h		; сброс
	dcx h			; регистр команд
	mvi m, 4dh		; 0.1001101  77 (77+1 знакомест)
	mvi m, 1dh		; 00.011101  29 (29+1 строк)
	mvi m, 77h; 7 линий без подчёркивания, 7 линий в знакоместе
	mvi m, 73h	; немерцающее подчёркивание, атрибут поля прозрачный
;ПДП
	mvi a, 80h
	sta 0f808h; запись управляющего слова в регистр управления
	lxi h, 0f804h
	mvi m, lo(scrn);0d0h;мл. адрес откуда
	mvi m, hi(scrn);76h ст. адрес откуда
	inx h; 0f805h
	mvi m, 23h
	mvi m, 49h ; размер массива 0923h и единица в разряде D14 - направление передачи
;ПДП end
	lxi h, 0d001h
	mvi m, 27h
	mvi m, 0e0h
;ПДП
	mvi a, 0a4h ;автозагрузка, удлинённая запись, канал 2
	sta 0f808h
;ПДП end
	ret

pusk_vg:
	lxi h, 0d001h	; регистр признаков
	mvi m, 00h		; сброс
	dcx h			; регистр команд
	mvi m, 4dh		; 0.1001101  77 (77+1 знакомест)
	mvi m, 1dh		; 00.011101  29 (29+1 строк)
	; 1001.1001  9 9 (9+1 линия подчерк)
	; (9+1 линий в знакоместе)
	mvi m, 99h;mvi m, 77h;;пробуем изменить линии в знакоместе
	mvi m, 93h; мерцающее подчёркивание
	inx h
	mvi m, 27
AFAE1:
	mov a, m
	ani 20h
	jz AFAE1
	
;ПДП
	mvi a, 80h
	sta 0f808h; запись управляющего слова в регистр управления
	lxi h, 0f804h
	mvi m, lo(scrn);0d0h;мл. адрес откуда
	mvi m, hi(scrn);76h ст. адрес откуда
	inx h; 0f805h
	mvi m, 23h
	mvi m, 49h ; размер массива 0923h и единица в разряде D14 - направление передачи
	mvi a, 0a4h ;автозагрузка, удлинённая запись, канал 2
	sta 0f808h
;ПДП end
	ret

P_VG75: 
	lxi h, 0d001h ; команда формат экрана
	mvi m, 00h
	dcx h
	mvi m, 4dh	; 77 --> т.е 78 колонок
	mvi m, 25h	; 37+1 строк (т.е всего 39 строк)
	mvi m, 77h	; 8 линий в знакоместе, 8 подчёркив-е
	mvi m, 53h	; 0101.0011
	;mvi m, 27h	; команда начало отображения
	;mov a, m
;wait:
;	mov a,m
;	ani 20h
;	jz wait
	mvi a, 80h
	sta 0f808h	; 0f800 - адрес ПДП ВТ57
	mvi a, 0D0h
	sta 0f804h	; начальный адрес экрана 74D0H
	mvi a, 076h
	sta 0f804h	; начальный адрес экрана 74D0H
	mvi a, 093h
	sta 0f805h	; режим
	mvi a, 04bh
	sta 0f805h	; режим
	mvi a, 0a4h
	sta 0f808h
	ret

;Единственно рабочий вариант
from_ball:
	lxi h, 0d001h	; регистр признаков
	mvi m, 00h		; сброс
	dcx h			; регистр команд
	mvi m, 4dh		; 0.1001101  77 (77+1 знакомест)
	mvi m, 1dh		; 00.011101  29 (29+1 строк)
	mvi m, 08h		; 7 линий без подчёркивания, 7 линий в знакоместе
	;mvi m, 93h		; немерцающее подчёркивание, атрибут поля прозрачный **
	mvi m, 0b3h		; немерцающее подчёркивание**
	inx h
	mvi m, 27h
	ret

msg:
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 013h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 016h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 004h, 014h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 013h, 003h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 004h, 014h, 016h, 017h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 016h, 017h, 017h, 017h, 017h, 017h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 004h, 014h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 014h, 016h, 017h, 017h, 017h, 017h, 017h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 013h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 016h, 017h, 017h, 017h, 017h, 013h, 001h, 020h, 020h, 020h, 020h, 020h, 014h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 003h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 014h, 014h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 007h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 011h, 020h, 020h, 020h, 020h, 020h, 020h, 016h, 017h, 017h, 017h, 017h, 001h, 020h, 020h, 020h, 020h, 014h, 016h, 017h, 017h, 017h, 017h, 017h, 003h, 003h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 014h, 014h, 014h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 006h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 020h, 020h, 020h, 020h, 020h, 020h, 006h, 017h, 017h, 017h, 013h, 020h, 020h, 020h, 020h, 014h, 017h, 017h, 017h, 013h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 014h, 014h, 014h, 016h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 002h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 020h, 020h, 020h, 020h, 020h, 004h, 017h, 017h, 017h, 013h, 020h, 020h, 020h, 014h, 017h, 013h, 003h, 001h, 020h, 020h, 004h, 014h, 014h, 014h, 014h, 014h, 014h, 014h, 014h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 013h, 020h, 020h, 020h, 020h, 020h, 016h, 017h, 017h, 013h, 020h, 020h, 004h, 017h, 013h, 001h, 004h, 014h, 012h, 003h, 003h, 003h, 003h, 003h, 003h, 003h, 007h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 003h, 003h, 001h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 006h, 017h, 017h, 017h, 017h, 017h, 017h, 011h, 020h, 020h, 020h, 020h, 004h, 017h, 017h, 013h, 020h, 020h, 016h, 013h, 004h, 012h, 007h, 017h, 020h, 017h, 006h, 015h, 014h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 002h, 003h, 003h, 003h, 007h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 003h, 003h, 003h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 017h, 017h, 017h, 017h, 017h, 017h, 015h, 020h, 020h, 020h, 020h, 006h, 017h, 017h, 020h, 020h, 016h, 005h, 016h, 017h, 001h, 016h, 017h, 020h, 017h, 013h, 015h, 007h, 013h, 014h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 014h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 002h, 017h, 017h, 017h, 017h, 017h, 017h, 020h, 020h, 020h, 020h, 017h, 017h, 011h, 020h, 016h, 001h, 016h, 017h, 013h, 020h, 017h, 017h, 004h, 017h, 011h, 017h, 012h, 017h, 002h, 017h, 010h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 015h, 010h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 006h, 017h, 017h, 017h, 017h, 017h, 010h, 020h, 020h, 020h, 017h, 017h, 020h, 006h, 001h, 016h, 017h, 017h, 001h, 016h, 017h, 011h, 006h, 017h, 020h, 017h, 011h, 007h, 011h, 002h, 017h, 010h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 014h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 007h, 017h, 017h, 017h, 017h, 015h, 020h, 020h, 020h, 017h, 017h, 020h, 017h, 016h, 017h, 017h, 001h, 004h, 017h, 013h, 020h, 017h, 013h, 020h, 017h, 011h, 006h, 017h, 020h, 007h, 017h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 014h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 007h, 017h, 017h, 017h, 017h, 010h, 020h, 020h, 006h, 017h, 020h, 017h, 003h, 003h, 020h, 004h, 017h, 017h, 001h, 016h, 017h, 001h, 006h, 017h, 020h, 006h, 017h, 020h, 006h, 017h, 011h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 017h, 015h, 010h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 002h, 017h, 017h, 017h, 017h, 010h, 020h, 020h, 007h, 015h, 002h, 015h, 014h, 017h, 017h, 013h, 020h, 014h, 017h, 013h, 020h, 017h, 013h, 020h, 017h, 017h, 020h, 006h, 017h, 017h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 014h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 007h, 017h, 017h, 017h, 010h, 020h, 020h, 007h, 015h, 010h, 003h, 003h, 020h, 014h, 016h, 017h, 003h, 020h, 016h, 017h, 001h, 004h, 017h, 011h, 020h, 006h, 017h, 017h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 014h, 010h, 020h, 020h, 020h, 020h, 020h, 020h, 002h, 007h, 017h, 017h, 015h, 010h, 020h, 002h, 003h, 017h, 017h, 017h, 013h, 003h, 020h, 004h, 017h, 013h, 001h, 004h, 017h, 013h, 020h, 020h, 006h, 017h, 017h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 015h, 014h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 003h, 007h, 017h, 017h, 014h, 014h, 010h, 020h, 004h, 014h, 014h, 017h, 013h, 001h, 020h, 004h, 017h, 013h, 020h, 020h, 004h, 017h, 017h, 013h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 003h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 014h, 014h, 020h, 020h, 020h, 020h, 020h, 020h, 002h, 003h, 003h, 003h, 003h, 003h, 003h, 003h, 020h, 020h, 004h, 016h, 017h, 003h, 020h, 020h, 004h, 017h, 017h, 017h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 020h, 020h, 020h, 002h, 003h, 003h, 007h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 014h, 014h, 014h, 014h, 010h, 020h, 020h, 020h, 020h, 014h, 014h, 014h, 014h, 017h, 013h, 003h, 020h, 020h, 020h, 016h, 017h, 017h, 017h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 002h, 003h, 003h, 003h, 007h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 003h, 001h, 020h, 020h, 020h, 004h, 014h, 017h, 017h, 017h, 013h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 004h, 014h, 017h, 017h, 017h, 017h, 017h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 004h, 014h, 014h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 004h, 014h, 014h, 016h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 004h, 014h, 014h, 014h, 014h, 014h, 016h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 014h, 014h, 014h, 014h, 016h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 013h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 013h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 013h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 013h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 001h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h
  db 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 017h, 003h, 003h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h, 020h




      
